app/views/site/profile/ads/shared/_form.html.erb

SELECT "categories".* FROM "categories"
---
      <%= f.label 'Categoria' %>
      <%= f.collection_select :category_id, Category.all, :id, :description, {}, {class: "form-control"} %>