app/controllers/site/profile/ads_controller.rb

SELECT "categories".* FROM "categories"
---
  def edit
    @categories_for_select = Category.all